---
kind: type
id: T:Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs
source: html/bc6bbc27-ed14-c79d-9e00-5c43b9cf978c.htm
---
# Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs

The event arguments used by the DockableFrameVisibilityChanged event.

## Syntax (C#)
```csharp
public class DockableFrameVisibilityChangedEventArgs : RevitAPISingleEventArgs
```